app/Models/SatuanModel.php

    public function add($input){
        return $this->save($input);
---
INSERT INTO `satuan` (`satuan`) VALUES ('Roller')